FKDD_COPY_DIFF_3_2026-02-13/Reports/ПросмотрЛогаФронтаКассира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПросмотрЛогаФронтаКассира</Name>
			<Comment>Просмотр лога фронта кассира</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОтчета</Name>
					<Comment>Вид отчета: обороты, остатки, остатки и обороты</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакетаОформленияТабличногоДокумента</Name>
					<Comment>Имя макета оформления табличного документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФормыНастроек</Name>
					<Comment>Текущее имя формы настроек</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыводаОтчета</Name>
					<Comment>Режим отображения: табличный документ, сводная таблица, диаграмма</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыВыводаОтчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФильтрыОтчета</Name>
					<Comment>Список фильтров отчета </Comment>
					<Type>
						<v8:Type>d7p1:Filter</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеПоляОтбора</Name>
					<Comment>Доступные поля отбора в отчете</Comment>
					<Type>
						<v8:Type>cfg:CustomFields</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераКасс</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДетальныеЗаписиПоДокументам</Name>
					<Comment>Выводить детальные записи по документам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеПоляВОтдельнойКолонке</Name>
					<Comment>Выводить дополнительные группировок в отдельной колонке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Comment>Имя регистра для запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСвойства</Name>
					<Comment>Использование в запросе свойств</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Comment>Объект формирования отчета</Comment>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимНастройки</Name>
					<Comment>Режим настройки отчета: стандарт, эксперт</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиОтчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненныеНастройки</Name>
					<Comment>Сохраненные настройки отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыИзмеренийСтрок</Name>
					<Comment>Параметры, определяющие измерения отчета</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьАвтоотступ</Name>
					<Comment>Использовать автоотступ при выводе отчета</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаИсточникаДанных</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала отчета</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДетальныеЗаписи</Name>
					<Comment>Выводить детальные записи</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппировкиОтчета</Name>
					<Comment>Возможные группировки отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Использование текущей группировки отчета</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя группировки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Строковое представление группировки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расширение</Name>
							<Comment>Расширение(детализация) группировки</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
					<Comment>Показатели отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования показателя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФорматнаяСтрока</Name>
							<Comment>Форматная строка отображения показателя</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Положение</Name>
							<Comment>Положение показателя в табличном документе</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ПоложенияПоказателяТабличногоДокумента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Comment>Ширина колонки в табличном документе отчета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Функции</Name>
					<Comment>Функции отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Comment>Имя функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление функции</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования функции</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияСтроки</Name>
					<Comment>Измерения строк отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования текущего измерения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным в выборке</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип значения измерения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИзмеренияКолонки</Name>
					<Comment>Измерения колонок отчета</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Comment>Флаг использования текущего измерения</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьКДанным</Name>
							<Comment>Путь к данным в выборке</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Comment>Представление измерения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипИзмерения</Name>
							<Comment>Тип значения измерения</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Reports/ПросмотрЛогаФронтаКассира/Ext/ObjectModule.bsl
#Если Клиент Тогда
// Модуль отчета

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА
Перем ТекстЗапроса Экспорт;                            // хранит текст запроса отчета
Перем ПараметрыИспользованияПолейИПоказателей Экспорт; // хранит параметры использования полей и показателей
Перем ДеревоДоступныхПолей Экспорт;                    // хранит дерево доступных полей отчета
Перем СтруктураСвязиСвойств Экспорт;                   // хранит структуру связи свойств
Перем ПриемникПеретаскивания Экспорт;                  // хранит перетаскиваемый объект
Перем СтруктураНеСвязанныхПоказателей Экспорт;         // хранит структуру не связанных показателей
Перем ДополнительныеПоляОтчета Экспорт;                // хранит дополнительные поля отчета


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// проверка на использование группировки
Функция ИспользуетсяГруппировка(ИмяГруппировки) Экспорт
	Если ИзмеренияСтроки.Найти(ИмяГруппировки)<>Неопределено Тогда
		Возврат ИзмеренияСтроки.Найти(ИмяГруппировки).Использование;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

// Стандартная процедура настройки построителя отчета 
Процедура ЗаполнитьНачальныеНастройки(ИмяМакета, ИмяМакетаПараметров="Параметры") Экспорт
	// Заполним структуру параметров
	СтруктураПараметрыЗаполнения = Новый Структура();
	СтруктураПараметрыЗаполнения.Вставить("ОтчетОбъект",            ЭтотОбъект);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаТекстаЗапроса", ИмяМакета);
	СтруктураПараметрыЗаполнения.Вставить("ИмяМакетаПараметров",    ИмяМакетаПараметров);
	
	отЗаполнитьНачальныеНастройки(СтруктураПараметрыЗаполнения, глПрава);
	
	ПостроительОтчета.УсловноеОформление.Очистить();
         
    ЭлементОформления = ПостроительОтчета.УсловноеОформление.Добавить("Код");
         
    ОбластьОформления = ЭлементОформления.Область.Добавить("Дата");
    ОбластьОформления = ЭлементОформления.Область.Добавить("Пользователь");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Оборудование");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Источник");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Объект");
	ОбластьОформления = ЭлементОформления.Область.Добавить("GUID");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Действие");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Код");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Описание");
	ОбластьОформления = ЭлементОформления.Область.Добавить("Тип");
         
	ОтборОформления = ЭлементОформления.Отбор.Добавить("Тип");
	ОтборОформления.ВидСравнения = ВидСравнения.Равно;
	ОтборОформления.Значение = Истина;
	ОтборОформления.Использование = Истина;
         
    ЭлементОформления.Оформление.ЦветТекста.Значение = WebЦвета.Красный;
    ЭлементОформления.Оформление.ЦветТекста.Использование = Истина;     
    ЭлементОформления.Использование = Истина;
	
	ВыводитьДетальныеЗаписи = Истина;
	
КонецПроцедуры	//	ЗаполнитьНачальныеНастройки()

// формирует отчет в виде табличного документа
Функция СформироватьТабличныйДокумент(ДокументРезультат=Неопределено) Экспорт
	
	Если НЕ обПраво("РазрешитьДоступКЖурналуДействийКассира", глПрава) Тогда
		Предупреждение("Доступ к журналу регистрации действий кассира запрещен!");
		Возврат ДокументРезультат;
	КонецЕсли;
	
	Результат = отСформироватьТабличныйДокумент(ЭтотОбъект, ДокументРезультат, 0, глПрава);
	
	Возврат Результат;
	
КонецФункции

// Функция возвращает структуру форматирования полей
Функция СтруктураФорматированияПолей() Экспорт

	СтруктураФорматаПолей = Новый Структура;
	отСтруктураФорматированияПолей(ЭтотОбъект, СтруктураФорматаПолей);

	// Если необходимо, добавим другие или переустановим строки форматирования полей
	
	Возврат СтруктураФорматаПолей;

КонецФункции	//	СтруктураФорматированияПолей()

// проверка заполнения
Функция КорректностьЗаполнения(ПродолжитьФормирование) Экспорт
	
	ПродолжитьФормирование = Истина;
	Возврат Истина;
	
КонецФункции

// устанавливает флаг использование у измерений
Функция УстановитьИспользованиеИзмерений(ТекПостроитель) Экспорт
	
	ТекПостроитель.ВыбранныеПоля.Очистить();
	ТекПостроитель.Порядок.Очистить();

	Для Каждого ТекСтрока Из ДеревоДоступныхПолей.Строки Цикл
		ИмяПоля = СтрЗаменить(ТекСтрока.ПутьКДанным, ".", "");
		Если ТекПостроитель.ВыбранныеПоля.Найти(ИмяПоля) = Неопределено Тогда
			ТекПостроитель.ВыбранныеПоля.Добавить(ТекСтрока.ПутьКДанным, ИмяПоля);
		КонецЕсли;
	КонецЦикла;
	
	ТекПостроитель.Порядок.Добавить("Дата", "Дата", "Дата", НаправлениеСортировки.Возр);
	
	Возврат Истина;
	
КонецФункции

// возвращает макет построителя отчета
Функция ПолучитьМакетПостроителя(ТекПостроитель, МакетОтчета, ПараметрыОформления) Экспорт
	
	ГраницаМакета = ПараметрыОформления.ГраницаМакета;
	ГраницаМакета.Вставить("ГраницаКолонок", ГраницаМакета.ДопПоля);
	ГраницаМакета.Вставить("ГраницаКолонокСтрока", ГраницаМакета.ДопПоляСтрока);
	ГраницаМакета.Вставить("ГраницаТаблицы", Новый Структура("ГраницаСлева, ГраницаСверху, ГраницаСправа", ГраницаМакета.Измерения.ГраницаСлева, ГраницаМакета.Измерения.ГраницаСверху, ГраницаМакета.ИзмеренияПоГоризонтали.ГраницаСлева));
	ГраницаМакета.Вставить("ГраницаТаблицыСтрока", Новый Структура("ГраницаСлева, ГраницаСправа", ГраницаМакета.ИзмерениеСтрока.ГраницаСлева, ГраницаМакета.ИзмеренияПоГоризонталиСтрока.ГраницаСправа));
	
	ОбластьЗаголовок = МакетОтчета.Область(1, 2);
	ОбластьЗаголовок.Текст = "Лог фронта кассира";
	ОбластьЗаголовок.Шрифт = Новый Шрифт(ОбластьЗаголовок.Шрифт,, 12, Истина);
	
	ОбластьЗаголовок = МакетОтчета.Область(2, 2);
	ОбластьЗаголовок.Текст = "Отбор: " + ПолучитьТекстОтбора();
	ОбластьЗаголовок.Шрифт = Новый Шрифт(ОбластьЗаголовок.Шрифт,, 10, Истина);
	ОбластьЗаголовок.ЦветТекста = ЦветаСтиля.ЦветФонаВыделенияПоля;
	
	ОбластьЗаголовок = МакетОтчета.Область(3, 2);
	
	ТаблицаКолонок = Новый ТаблицаЗначений;
	ТаблицаКолонок.Колонки.Добавить("Представление");
	ТаблицаКолонок.Колонки.Добавить("Имя");
	ТаблицаКолонок.Колонки.Добавить("ШиринаКолонки");
	ТаблицаКолонок.Колонки.Добавить("Формат");
	
	Для Каждого ТекПоле Из ТекПостроитель.ВыбранныеПоля Цикл
		НоваяСтрока = ТаблицаКолонок.Добавить();
		НоваяСтрока.Имя             = ТекПоле.Имя;
		
		ТекПараметрыПоля = отПолучитьПолеИзПараметрыИспользованияПолейИПоказателей(ТекПоле.Имя, ПараметрыИспользованияПолейИПоказателей);
		Если ТекПараметрыПоля=Неопределено Тогда
			НоваяСтрока.Представление = ТекПоле.Имя;
			НоваяСтрока.ШиринаКолонки = 20;
			НоваяСтрока.Формат            = "";
		Иначе
			НоваяСтрока.Представление = ТекПараметрыПоля.Представление;
			НоваяСтрока.ШиринаКолонки = ТекПараметрыПоля.ШиринаКолонки;
			НоваяСтрока.Формат        = ТекПараметрыПоля.Формат;
		КонецЕсли;
	КонецЦикла; 
	
	отПолучитьМакетДетальныхЗаписейПостроителя(МакетОтчета, ПараметрыОформления, ТаблицаКолонок);
	
	Возврат Истина;
	
КонецФункции 

// возвращает текст отбора
Функция ПолучитьТекстОтбора()
	// Текст отборов
	Если ПостроительОтчета.Отбор.Количество() = 0 Тогда
		Отбор = "Без отбора";
	Иначе
		Отбор = "";
		Для Каждого ТекОтбор Из ПостроительОтчета.Отбор Цикл
			Если ТекОтбор.Использование И НЕ ТекОтбор.Имя = "Периодичность" Тогда
				ЗначОтбора="";
				Если ТипЗнч(ТекОтбор.Значение)=Тип("СписокЗначений") Тогда
					Для Каждого ТекЗначОтбор Из ТекОтбор.Значение Цикл
						ЗначОтбора = ЗначОтбора + ?(ЗначОтбора = "", "", "; ") + ТекЗначОтбор.Значение;
					КонецЦикла;
				ИначеЕсли ТекОтбор.Имя = "Дата" Тогда
					ВидСравненияВСтроку = Строка(ТекОтбор.ВидСравнения);
					ЗначОтбора = ВидСравненияВСтроку + " " + ?(Найти(ВидСравненияВСтроку, "Интервал") = 0, ТекОтбор.Значение, Строка(ТекОтбор.ЗначениеС) + " - " + Строка(ТекОтбор.ЗначениеПо));
				Иначе
					ЗначОтбора=ТекОтбор.Значение;
				КонецЕсли;
				Отбор = Отбор + ТекОтбор.Представление + ": " + ЗначОтбора + "," + Символы.ПС;
			КонецЕсли;
		КонецЦикла;
			
		Если Отбор = "" Тогда Отбор = "Все"; КонецЕсли; 
	КонецЕсли; 
	Возврат Отбор;
КонецФункции


//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

отОтчетПриИнициализацииОбъекта(ЭтотОбъект);
ПромежуточныеЗначенияПостроителя = Новый Структура();
СтруктураНеСвязанныхПоказателей = Новый Структура();
#КонецЕсли
